<template>
  <div class="social">
    <ul class="social__list">
      <li class="social__item">
        <a
          class="social__link social__link--telegram"
          href="https://t.me/nyukalo"
          target="_blank"
        >
          <span class="visually-hidden">Мой телеграм</span>
          <svg
            aria-hidden="true"
            focusable="false"
            width="32"
            height="32"
            viewBox="0 0 32 32"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M32 16c0 8.836-7.164 16-16 16S0 24.836 0 16 7.164 0 16 0s16 7.164 16 16zm-15.4267-4.188c-1.556.6467-4.6666 1.9867-9.3306 4.0187-.7574.3013-1.1547.596-1.1907.884-.0613.488.5493.68 1.3787.94.1133.036.2306.072.3506.112.8174.2653 1.916.576 2.4867.588.5187.0106 1.0973-.2027 1.736-.64 4.3573-2.9427 6.6067-4.4294 6.748-4.4614.1-.0226.2387-.052.332.032.0933.0827.084.24.0747.2827-.0614.2573-2.4534 2.4827-3.6934 3.6347-.3866.3586-.66.6133-.716.672a16.3393 16.3393 0 01-.376.372c-.76.7306-1.328 1.28.032 2.176.6534.4306 1.176.7866 1.6974 1.1413.5693.388 1.1373.7747 1.8733 1.2573.1867.1227.3653.2494.54.3734.6627.4733 1.2587.8973 1.9947.8306.4266-.04.8693-.4413 1.0933-1.64.5293-2.8346 1.572-8.9733 1.8133-11.504a2.814 2.814 0 00-.0266-.6293.6746.6746 0 00-.2294-.4333c-.1906-.156-.4866-.1894-.62-.1867-.6013.0107-1.524.332-5.968 2.18z"
              fill="#fff"
            />
          </svg>
        </a>
      </li>

      <li class="social__item">
        <a
          class="social__link social__link--github"
          href="https://github.com/PavelNyukalo"
          target="_blank"
        >
          <span class="visually-hidden">Мой GitHub</span>
          <svg
            aria-hidden="true"
            focusable="false"
            width="32"
            height="32"
            viewBox="0 0 32 32"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M16 0a16 16 0 00-5.06 31.18c.8.14 1.1-.34 1.1-.76l-.02-2.98c-4.02.74-5.06-.98-5.38-1.88-.18-.46-.96-1.88-1.64-2.26-.56-.3-1.36-1.04-.02-1.06 1.26-.02 2.16 1.16 2.46 1.64 1.44 2.42 3.74 1.74 4.66 1.32a3.37 3.37 0 011.02-2.14c-3.56-.4-7.28-1.78-7.28-7.9 0-1.74.62-3.18 1.64-4.3-.16-.4-.72-2.04.16-4.24 0 0 1.34-.42 4.4 1.64a14.85 14.85 0 018 0c3.06-2.08 4.4-1.64 4.4-1.64.88 2.2.32 3.84.16 4.24a6.2 6.2 0 011.64 4.3c0 6.14-3.74 7.5-7.3 7.9.58.5 1.08 1.46 1.08 2.96l-.02 4.4c0 .42.3.92 1.1.76A16.03 16.03 0 0032 16 16 16 0 0016 0z"
              fill="#fff"
            />
          </svg>
        </a>
      </li>

      <li class="social__item">
        <a
          class="social__link social__link--vk"
          href="https://vk.com/pavill_cavill"
          target="_blank"
        >
          <span class="visually-hidden">Мой ВКонтакте</span>
          <svg
            aria-hidden="true"
            focusable="false"
            width="32"
            height="32"
            viewBox="0 0 32 32"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16 .64a15.36 15.36 0 100 30.72A15.36 15.36 0 0016 .64zm5.9 17.33s1.37 1.34 1.7 1.96l.02.03c.13.23.17.41.1.54-.11.22-.5.33-.63.34h-2.4c-.17 0-.51-.04-.94-.33-.32-.23-.64-.6-.95-.96-.47-.55-.87-1.01-1.28-1.01-.05 0-.1 0-.15.02-.3.1-.7.54-.7 1.7 0 .37-.29.58-.5.58h-1.1c-.37 0-2.32-.13-4.04-1.95C8.9 16.66 7 12.18 6.99 12.14c-.12-.3.13-.45.4-.45H9.8c.33 0 .43.2.5.37.1.2.4 1.02.93 1.92.84 1.49 1.36 2.09 1.77 2.09.08 0 .16-.02.23-.06.54-.3.44-2.23.41-2.63 0-.07 0-.86-.28-1.24-.2-.27-.53-.38-.74-.42.08-.11.2-.2.32-.27a4.44 4.44 0 011.7-.2h.37c.72 0 .91.05 1.17.11.53.13.54.47.5 1.64-.02.33-.04.7-.04 1.14v.31c-.02.6-.04 1.27.38 1.55.06.03.12.05.19.05.14 0 .58 0 1.77-2.04.36-.65.68-1.34.95-2.04.02-.04.1-.17.18-.22a.43.43 0 01.2-.04h2.84c.32 0 .53.04.57.16.07.2-.01.77-1.32 2.54l-.58.76c-1.18 1.55-1.18 1.63.08 2.8z"
              fill="#fff"
            />
          </svg>
        </a>
      </li>
    </ul>
  </div>
</template>

<style lang="scss">
@import "../../sass/variables.scss";

.social__list {
  list-style: none;

  display: flex;
  justify-content: space-between;
  flex-wrap: wrap;
  padding: 0;
}

.social__link {
  display: block;
  width: 32px;
  height: 32px;
  margin: 5px;

  &:hover path {
    fill: $social-bg-grey;
  }

  &:focus {
    outline: 1px solid $white;
  }

  &:active {
    opacity: 0.5;
  }
}
</style>
